Can't keep elements joined. Avoid converting stairs to skeched-based component in Multistory stairs.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
 Syntax
  C#
public static FailureDefinitionId MultistoryStairsComponentJoinFailure { get; }
  Visual Basic
Public Shared ReadOnly Property MultistoryStairsComponentJoinFailure As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ MultistoryStairsComponentJoinFailure {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures StairRampFailures Class
  Autodesk.Revit.DB Namespace